import React from 'react';
import NestedIntlProvider from 'frontend/components/NestedIntlProvider';

const MESSAGES = {
	game_rules: 'กฎการเล่นเกม',
	applicability: {
		title: 'การใช้กฎเหล่านี้',
		description1:
			'กฎเฉพาะสำหรับผลิตภัณฑ์ต่อไปนี้ ("กฎการเล่นเกม") ควบคุมผู้ใช้ ("ผู้เล่น", ' +
			'"คุณ" หรือ "ของคุณ") ในการใช้งานผลิตภัณฑ์หรือบริการคาสิโน ("เกมคาสิโน") ' +
			'แบบอินเตอร์แอกทีฟทั้งหมดของผู้ให้บริการ (หรือของ SBOBET Casino) ที่เปิดให้บริการที่',
		description2: 'casino.SBOBET.com ',
		description3:
			'("เว็บไซต์") สิ่งเหล่านี้ประกอบกันเป็นข้อตกลงและเงื่อนไขของผู้ให้บริการ ' +
			'ซึ่งใช้กับเกมคาสิโนทั้งหมด และบริการที่ผู้ให้บริการเสนอให้ และผู้เล่นต้องยอมรับในขณะที่ลงทะเ' +
			'บียนเพื่อเล่นเกมคาสิโนใดๆ ในกรณีที่มีความขัดแย้งกันระหว่าง ข้อตกลงและเงื่อนไข และกฎการเล่น' +
			'เกมเหล่านี้ จะยึดถือตามข้อตกลงและเงื่อนไขเป็นหลัก',
	},
	general_rules: 'กฎการเล่นเกมทั่วไป',
	liability: {
		title: 'ความรับผิดชอบ',
		description:
			'ถ้าผู้เล่นไม่มีข้อเท็จจริงหรือเหตุผลเพียงพอ ผู้เล่นไม่มีสิทธิ์ยื่นข้อเรียกร้องต่อผู้พัฒนา' +
			'ซอฟต์แวร์เกมคาสิโนในเรื่องใดๆ รวมถึง สาเหตุและสิ่งต่างๆ ที่เกี่ยวข้องกับการเข้าร่วมของผู้เล่นในเกมคาสิโนหรืออื่นๆ',
	},
	playForFun: {
		title: 'เล่นเพื่อความเพลิดเพลิน',
		description:
			'ผู้เล่นเห็นพ้องว่าเกมคาสิโนมีคุณค่าสำหรับความบันเทิงเท่านั้น ผู้เล่นเข้าใจและรับทราบว่า ' +
			'ผู้เล่นไม่จำเป็นต้องเดิมพันเป็นเงินในการเล่นเกมคาสิโน ถ้าผู้เล่นต้องการเล่นโดยไม่ใช้เงินจริงในการเดิมพัน ' +
			'ผู้เล่นสามารถทำได้โดยการเล่นในบริเวณ "สาธิตการเล่น" เท่านั้น.',
	},
	personalUse: {
		title: 'การใช้ส่วนบุคคลเท่านั้น',
		description:
			'ความสนใจของผู้เล่นในคาสิโนและเว็บไซต์นี้เป็นเรื่องส่วนบุคคล ไม่ใช่วิชาชีพ ' +
			'ผู้เล่นเข้าถึงเว็บไซต์นี้เพื่อความบันเทิงส่วนบุคคลเท่านั้น ห้ามการเข้าถึง การเรียกใช้ ' +
			'หรือการเรียกใช้ซ้ำเกมคาสิโนนี้เพื่อการอื่นๆ อย่างเด็ดขาด.',
	},
	malfunctions: {
		title: 'การใช้งานในทางที่ผิด',
		description:
			'ถ้ามิได้มีการระบุเป็นอื่น ข้อผิดพลาดต่างๆ ด้านล่าง (เช่น ในเกมสดบางอย่าง) ' +
			'ที่เกิดจากสาเหตุใดๆ (ซอฟต์แวร์หรือฮาร์ดแวร์) จะทำให้การเล่นเป็นโมฆะ นั่นหมายความว่า ' +
			'เงินเดิมพันใดๆ ที่วางไว้จะถูกคืนโดยไม่คำนึงว่าผลจะออกมาเป็นอย่างไร',
	},
	smartPlayer: {
		title: 'ผู้เล่นสมาร์ทและปัญญาประดิษฐ์',
		description:
			'คาสิโน SBOBET ขอสงวนสิทธิ์ในการปฏิเสธผู้เล่นสมาร์ทหรือผู้เล่นสมาร์ทที่น่' +
			'าสงสัยและเคาน์เตอร์บัตร กิจกรรมที่ใช้ปัญญาประดิษฐ์ที่เรียกว่าบอทเป็นสิ่งต้องห้ามอย่างเคร่งครัด ' +
			'ความพยายามที่จะฝ่าฝืนหรือละเมิดนโยบายนี้จะมีผลในการระงับและการยกเว้นจากบัญชีของผู้เล่น ' +
			'เงินที่ได้มาทั้งหมดและค่าคอมมิชชั่นจะถูกริบ',
	},
	complaintsRng: {
		title: 'คำร้องเรียนเกี่ยวกับเกมที่สร้างตัวเลขสุ่ม',
		description1:
			'ถ้าผู้เล่นมีข้อร้องเรียนใดๆ เกี่ยวกับแง่มุมของเกมคาสิโน (สำหรับเกมคาสิโนที่เล่นสด ' +
			'ผู้เล่นสามารถดำเนินการตามกระบวนการร้องเรียนด้านล่าง) ผู้เล่นควรส่งรายละเอียดข้อร้องเรียนภายใน 14 ' +
			'(สิบสี่) วันนับจากวันที่เหตุการณ์เกิดขึ้นมาที่ ',
		description2: 'support@sbobet.com ',
		description3:
			' พร้อมกับรหัสผู้ใช้ เวลา และวันที่เล่น รวมถึงข้อมูลเพิ่มเติมที่อาจเกี่ยวข้อง โปรดทราบว่า ' +
			'ผู้ให้บริการจะตรวจสอบและวินิจฉัยคำร้องเรียนอย่างละเอียดโดยใช้ข้อมูลจากเซิร์ฟเวอร์ของผู้ให้บริการ ' +
			'แต่การตัดสินชี้ขาดจะเป็นไปตามผู้ให้บริการโดยพิจารณาจากเหตุผลประกอบทั้งหมดอย่างเป็นธรรม',
	},
	complaintsLg: {
		title: 'คำร้องเรียนเกี่ยวกับการเล่มเกมสด',
		description1:
			'ถ้าผู้เล่นประสงค์จะร้องเรียนหรือโต้แย้งเกี่ยวกับผลของเกมคาสิโนที่เล่นสด ' +
			'ผู้เล่นจะต้องให้รหัสผู้ใช้กับผู้ให้บริการ รวมถึง เวลาที่เล่น ชื่อเจ้ามือ หมายเลขโต๊ะ และหมายเลขรอบการเล่น ' +
			'ณ เวลาที่ติดต่อกับผู้ให้บริการ การไม่ดำเนินการดังกล่าวอาจมีผลให้ผู้ให้บริการไม่สามารถพิจารณาคำร้องของผู้เล่นได้ ' +
			'ภาพวิดีโอของเกมคาสิโนที่เล่นสดจะถูกเก็บเป็นเวลา 24 ชั่วโมง ดังนั้น ผู้เล่นจะต้องยื่นคำร้องภายใน 24 ชม. ' +
			'เมื่อมีประเด็นเกิดขึ้น คำร้องที่ส่งหลังจาก 24 ชั่วโมงจะถูกปฏิเสธโดยผู้ให้บริการ เนื่องจากไม่มีหลักฐานทางวิดีโอ',
		description2:
			'ในกรณีที่มีข้อโต้แย้ง ผู้เล่นรับทราบและเห็นพ้องว่า การตัดสินของผู้ให้บริการถือเป็นขั้นเด็ดขาดและเป็นทางการ',
	},
	maxWin: {
		title: 'การชนะสูงสุด',
		description: 'ไม่มีข้อกำหนดเกี่ยวกับการชนะสูงสุดในแต่ละวัน',
	},
	liveCasinoGames: {
		title: 'เกมคาสิโนสด',
		description1:
			'สำหรับเกมคาสิโนสด ผลลัพธ์ที่ถูกต้องในเกมคาสิโน ก็คือผลลัพธ์ซึ่งถูกตรวจจับโดยอุปกรณ์เซนเซอร์อิ' +
			'เล็กทรอนิกส์ที่ติดตั้งไว้สำหรับวัตถุประสงค์นั้น ถ้ามีเหตุผลใดๆ ที่ทำให้ผลลัพธ์ไม่ได้รับการตรวจจับ ' +
			'และลงทะเบียนโดยเซนเซอร์อิเล็กทรอนิกส์ ผลลัพธ์นั้นจะถูกลงความเห็นว่าไม่ได้เกิดขึ้น ' +
			'และเงินเดิมพันที่ล็อคอยู่จะยังคงถูกล็อคต่อไป จนกระทั่งหาผลลัพธ์ที่ถูกต้องได้',
		description2:
			'กฎเฉพาะเกี่ยวกับการทำงานผิดพลาดต่างๆ ในเกมคาสิโนสด รวมอยู่ในกฎเกมคาสิโนเฉพาะด้านล่าง ' +
			'โปรดคลิกซ้ายที่ชื่อของเกมคาสิโน เพื่อดูกฎเฉพาะสำหรับเกมคาสิโนนั้น:',
	},
	casinoGames: {
		live_dealer_baccarat: 'แบคคาร่า เจ้ามือสด',
		live_dealer_roulette: 'รูเล็ตต์ เจ้ามือสด',
		live_dealer_sicbo: 'ซิคโบ้ เจ้ามือสด',
		live_dealer_blackjack: 'ไลฟ์ดีลเลอร์แบล็คแจ็ค',
		games: 'GAMES',
		slot: 'SLOT',
		card: 'CARD',
		table: 'TABLE',
	},
};

export default function Provider({ children, ...props }) {
	return (
		<NestedIntlProvider {...props} messages={MESSAGES}>
			{children}
		</NestedIntlProvider>
	);
}
